/*
 * Да се напише програма што ќе ја испечати сумата на сите броеви деливи со 3 во интервалот [A,B). А и B се внесуваат од тастатура.

Објаснување на примерот.

А=10, B = 20. Броеви кои припаѓаат во интервалот се 10,11,12,13,..,19. Од нив деливи со 3 се броевите 12,15,18, па нивната сума е 45.

For example:

Input	Result
10 20
        45*/

#include <stdio.h>
#include <stdlib.h>

int main()
{
    int a, b;
    scanf("%d %d", &a, &b);
    int suma=0;
    for(int i=a;i<b;i++){
        if(i%3==0){
            suma+=i;
        }
    }
    printf("%d", suma);
}
