/*
 * Да се напише програма во која во даден опсег на природни броеви [a,b], ќе се најдат и отпечатат сите броеви чијшто збир на цифри кои се деливи со 2, но НЕ се деливи со 3, е поголем од 0 и е делив со 7. На крај да се отпечати и бројот на вакви броеви.

For example:

Input	    Result
2000 4000
            2048
            2084
            2148
            2184
            2228
            2282
            2348
            2384
            2408
            2418
            2438
            2444
            2458
            2468
            2478
            2480
            2481
            2483
            2485
            2486
            2487
            2489
            2498
            2548
            2584
            2648
            2684
            2748
            2784
            2804
            2814
            2822
            2834
            2840
            2841
            2843
            2845
            2846
            2847
            2849
            2854
            2864
            2874
            2894
            2948
            2984
            3248
            3284
            3428
            3482
            3824
            3842
            Vkupno: 52*/
#include <stdio.h>
#include <stdlib.h>

int zbirCifri(int i)
{
    int zbir = 0;
    while (i != 0)
    {
        if ((i % 10) % 2 == 0 && (i % 10) % 3 != 0)
            zbir += i % 10;
        i /= 10;
    }

    if (zbir % 7 == 0 && zbir != 0)
        return 1;
    else
        return 0;
}

int main()
{
    int a,b;
    scanf("%d %d",&a, &b);
    int br=0;
    for(int i=a;i<=b;i++){
        if(zbirCifri(i)){
            printf("%d\n",i);
            br++;
        }
    }
    printf("Vkupno: %d", br);
}