/*Еден пајак секогаш ја плете својата мрежа на ист начин. Така, тој плете по сите страни на еден квадрат и по неговата споредна дијагонала. Ако при влез од тастатура се внесе број n кој е поголем или еднаков на 5, испечатете ја мрежата која би ја сплетил пајакот. Пример, кога n=5:

*****
*  **
* * *
**  *
*****
For example:

Input	Result
12
        ************
        *         **
        *        * *
        *       *  *
        *      *   *
        *     *    *
        *    *     *
        *   *      *
        *  *       *
        * *        *
        **         *
        ************
 * */
#include <stdio.h>
#include <stdlib.h>

int main()
{
    int n;
    scanf("%d", &n);
    if(n<5){
        return 0;
    }
    for(int i=0;i<n;i++){
        for(int j=0;j<n;j++)
        {
            if(i==0||i==n-1||j==0||j==n-1||i+j==n-1){
                printf("*");
            }
            else printf(" ");
        }
        printf("\n");
    }
}
