/*
Да се напише програма која за даден број К ќе дешифрира која буква во латинската азбука се појавува после К букви од почетната буква C. К може да биде поголемо од бројот на букви во азбуката, при што броењето ќе продолжи од почеток (циклично). Се земаат во предвид само големи букви. На влез се читаат C и К, а на излез се печати дешифрираната буква. Задачата да се реши користејќи низа за големите букви од латинската азбука и при дешифрирање да се користат стандардните операции за низи.

For example:

Input	Result
B 3
        E
*/
#include <stdio.h>

int main()
{
    char azbuka[]={'A','B','C','D','E','F','G','H','I',
                   'J','K','L','M','N','O','P','Q',
                   'R','S','T','U','V','W','X','Y','Z'};

    char c;
    int k;
    scanf("%c %d", &c, &k);
    int poz;
    for(int i=0;i<26;i++){
        if(azbuka[i]==c){
            poz=i;
            break;
        }
    }
    poz+=k;
    while(poz>=26) poz-=26;
    printf("%c", azbuka[poz]);
}