/*
 * Од стандарден влез се чита позитивен број n кој ги дава димензиите на квадратна матрица од цели броеви, која се чита во продолжение. Да се напише програма која за таа матрица(макс. 100 x 100) ќе ја испечати должината на најдолгата строго растечка подниза, доколку матрицата ја гледаме ред по ред.

На пример, ако е дадена следната матрица:

1 2 3 9 8
5 5 5 5 5
0 1 2 0 0
9 1 2 3 4
1 1 1 1 1
должината на најдолгата строго растечка подниза е 4, а тоа е должината на поднизата 1 2 3 4, во четвртиот ред.

For example:

Input	Result
2
1 2
2 1
        2
*/
#include <stdio.h>

int main()
{
    int n;
    scanf("%d", &n);
    int matrix[100][100];
    for(int i=0;i<n;i++){
        for(int j=0;j<n;j++){
            scanf("%d", &matrix[i][j]);
        }
    }

    int length=0;
    for(int i=0;i<n;i++){
        int currLength=0;
        for(int j=0;j<n-1;j++){
            if(matrix[i][j]<matrix[i][j+1]){
                currLength++;
                if(length<currLength){
                    length=currLength;
                }
            }
        }
    }
    printf("%d", length+1);
}