/*
Од тастатура се внесува број на студенти кои ќе полагаат колоквиум, а потоа и индексите (цели броеви) на сите студенти кои ќе полагаат колоквиум. Програмата треба да ги подели студентите во три групи: студенти со индекси кои завршуваат на цифрата 0, 1 и 2, студенти со индекси кои завршуваат на цифрата 3, 4, 5 и студенти со индекси кои завршуваат на цифрата 6, 7, 8, 9. Програмата треба да ги испечати индексите за секоја група, во истиот редослед како што биле внесени. Максималниот број на студенти што може да се внесат е 1000.

Влез:

10 //Kolku studenti?

20010 20145 20147 20139 20581 19452 19873 19825 19458 20653 //Koi studenti?


Излез

Grupa 1

20010 20581 19452


Grupa 2

20145 19873 19825 20653


Grupa 3

20147 20139 19458


For example:

Input	                                                            Result
10
20010 20145 20147 20139 20581 19452 19873 19825 19458 20653
                                                                    Grupa 1
                                                                    20010 20581 19452
                                                                    Grupa 2
                                                                    20145 19873 19825 20653
                                                                    Grupa 3
                                                                    20147 20139 19458
15
20111 20145 20142 20133 20581 19452 19878 19826 19455 20652 20123 21218 113204 178000 115177

                                                                    Grupa 1
                                                                    20111 20142 20581 19452 20652 178000
                                                                    Grupa 2
                                                                    20145 20133 19455 20123 113204
                                                                    Grupa 3
                                                                    19878 19826 21218 115177
 */
#include <stdio.h>
int main()
{
    int n;
    scanf("%d", &n);
    int niza[1000];
    for(int i=0;i<n;i++){
        scanf("%d", &niza[i]);
    }
    int prva[1000], vtora[1000], treta[1000];
    int brElementi1=0, brElementi2=0, brElementi3=0;
    for(int i=0;i<n;i++){
        if(niza[i]%10==0 || niza[i]%10==1 || niza[i]%10==2){
            prva[brElementi1++]=niza[i];
        }
        if(niza[i]%10==3 || niza[i]%10==4 || niza[i]%10==5){
            vtora[brElementi2++]=niza[i];
        }
        if(niza[i]%10==6 || niza[i]%10==7 || niza[i]%10==8 || niza[i]%10==9){
            treta[brElementi3++]=niza[i];
        }
    }
    printf("Grupa 1\n");
    for(int i=0;i<brElementi1;i++){
        printf("%d ", prva[i]);
    }
    printf("\n");
    printf("Grupa 2\n");
    for(int i=0;i<brElementi2;i++){
        printf("%d ", vtora[i]);
    }
    printf("\n");
    printf("Grupa 3\n");
    for(int i=0;i<brElementi3;i++){
        printf("%d ", treta[i]);
    }
}