/*
Од стандарден влез се внесуваат два цели броја N и Х.

Да се најде најблискот број помал од N коj е тотално различен од бројот Х.

Еден број е тотално различен од друг ако и само ако во него не се појавува ниту една од цифрите на другиот број.

Задачата да се реши без употреба на низи и матрици.

For example:

Input	Result
88 7
        86
 */
#include <stdio.h>

int main()
{
    int n, x;
    scanf("%d %d", &n, &x);
    n--;
    for(n;n>0;n--){
        int ista=0;
        for(int i=n;i!=0;i/=10){
            for(int j=x;j!=0;j/=10){
                if(i%10==j%10){
                    ista=1;
                }
            }
        }
        if(!ista){
            break;
        }
    }
    printf("%d",n);
}
