/*
Oд стандарден влез се вчитува еден цел број X, димензии на матрица M и N (цели броеви), како и елементите на матрицата со димензии M x N (цели броеви). Да се напише програма што ќе ги промени редиците на матрицата на следниот начин:

Ако збирот на елементите од редот е поголем од X, елементите на тој ред добиваат вредност 1
Ако збирот на елементите од редот е помал од X, елементите на тој ред добиваат вредност -1
Ако збирот на елементите од редот е еднаков на X, елементите на тој ред добиваат вредност 0
Променетата матрица да се испечати на екран.

Пример.

Влез:

31

4317652881415716945111576

Излез:

−1−1100−1−1100−1−1100−1−1100

For example:

Input	        Result
17
4 6
1 5 7 2 1 1
10 0 0 5 1 1
5 8 3 9 1 0
9 8 2 5 3 4
                0 0 0 0 0 0
                0 0 0 0 0 0
                1 1 1 1 1 1
                1 1 1 1 1 1
 */
#include <stdio.h>

int main()
{
    int x, m, n;
    scanf("%d", &x);
    scanf("%d %d", &m, &n);
    int matrix[100][100];
    for(int i=0;i<m;i++){
        for(int j=0;j<n;j++){
            scanf("%d", &matrix[i][j]);
        }
    }

    for(int i=0;i<m;i++){
        int zbir=0;
        for(int j=0;j<n;j++){
            zbir+=matrix[i][j];
        }
        if(zbir>x){
            for(int j=0;j<n;j++){
                matrix[i][j]=1;
            }
        }
        else if (zbir<x){
            for(int j=0;j<n;j++){
                matrix[i][j]=-1;
            }
        }
        else{
            for(int j=0;j<n;j++){
                matrix[i][j]=0;
            }
        }
    }

    for(int i=0;i<m;i++){
        for(int j=0;j<n;j++){
            printf("%d ", matrix[i][j]);
        }
        printf("\n");
    }
}