/*
За квадратна матрица А со димензии n x n, од стандарден влез се внесува бројот n (n > 2) и елементите на матрицата (реални броеви). Нека X e збирот од елементите под главната дијагонала во матрицата А. Нека Y е збирот од елементите под споредната дијагонала во матрицата А. Да се креира нова матрица B на следниот начин:

сите елементи од главната дијагонала во матрицата B треба да имаат вредност X

сите елементи од споредната дијагонала во матрицата B треба да имаат вредност Y

ако даден елемент припаѓа и на главната и на споредната дијагонала во матрицата B, тогаш неговата вредност e X+Y

сите останати елементи во матрицата B имаат вредност 0

Новата матрица B да се испечати на стандарден излез.


For example:

Input	        Result
3
101 202 303
11 22 33
1 2 3
                14.0 0.0 38.0
                0.0 52.0 0.0
                38.0 0.0 14.0
 */
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>


int main()
{
    int n;
    scanf("%d", &n);
    float matrix[100][100];
    for(int i=0;i<n;i++){
        for(int j=0;j<n;j++){
            scanf("%f", &matrix[i][j]);
        }
    }

    float x=0, y=0;
    for(int i=0;i<n;i++){
        for(int j=0;j<n;j++){
            if(i>j){
                x+=matrix[i][j];
            }
            if(i+j>=n){
                y+=matrix[i][j];
            }
        }
    }

    float temp[100][100];
    for(int i=0;i<n;i++){
        for(int j=0;j<n;j++){
            if(i==j && (i+j)==n-1) temp[i][j]=x+y;
            else if(i==j) temp[i][j]=x;
            else if((i+j)==n-1) temp[i][j]=y;
            else temp[i][j]=0;
        }
    }

    for(int i=0;i<n;i++){
        for(int j=0;j<n;j++){
            printf("%.1f ", temp[i][j]);
        }
        printf("\n");
    }
}