/*
Еден елемент од матрица ја дели матрицата на 4 квадранти (прикажани на сликата). Притоа самиот елемент кој ја дели матрицата припаѓа во четвртиот квадрант (-5 во примерот на сликата).

Од стандарден влез се внесува матрица со димензии NxM (1 <= N, M < 100). Потоа се внесуваат два броеви кои претставуваат индекси на еден елемент од матрицата.

Да се најдат сумите на секој од квадрантите и да се испечатат на стандарен излез. Притоа се печати сумата за првиот квадрант, па за вториот, па третиот и на крај за четвртиот. Доколку не може да се креира квадрант, тогаш за сумата на тој квадрант треба да се испечати 0.



For example:

Input	Result
2 3
5 7 8
1 2 3
1 1
        15 5 1 5
 */
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>



int main()
{
    int n, m;
    scanf("%d %d", &n, &m);
    int matrix[100][100];
    for(int i=0;i<n;i++){
        for(int j=0;j<m;j++){
            scanf("%d", &matrix[i][j]);
        }
    }
    int x, y;
    scanf("%d %d", &x, &y);
    int k1=0, k2=0, k3=0, k4=0;
    for(int i=0;i<n;i++){
        for(int j=0;j<m;j++){
            if(i<x && j>=y){
                k1+=matrix[i][j];
            }
            else if(i<x && j<y){
                k2+=matrix[i][j];
            }
            else if(i>=x && j<y){
                k3+=matrix[i][j];
            }
            else{
                k4+=matrix[i][j];
            }
        }
    }
    printf("%d %d %d %d", k1, k2, k3, k4);
}