/*
Да се напише рекурзивна функција која што прима еден аргумент број x која што ќе враќа 1 доколку секоја цифра во бројот е помала од предходната, а во спротивно 0.

Пример бројот 54321 е опаѓачки, додека пак бројот 54123 не е опаѓачки број.

Од стандарден влез се вчитува прво број N, а потоа N броеви. За секој број да се испечати 1 или 0 (во нов ред), доколку бројот е опаѓачки или не е опаѓачки.

For example:

Input	Result
5
54321
6521
12
5
777
        1
        1
        0
        1
        0
 */
#include <stdio.h>
#include <stdlib.h>

int function(int x){
    if(x<10){
        return 1;
    }
    else{
        if(((x%10)<(x/10%10))==function(x/10)){
            return x%10<x/10%10;
        }
        else return 0;
    }
}

int main()
{
    int n;
    scanf("%d", &n);
    int broj;
    for(int i=0;i<n;i++){
        scanf("%d", &broj);
        printf("%d\n", function(broj));
    }
}
