/*
Да се напише рекурзивна функција f() која за даден природен број ќе го пресмета и враќа збирот на сите цифри кои се наоѓаат на парни позиции (гледано од десно кон лево). Се смета дека најмалку значајната цифра е на 1-ва позиција. Потоа да се напише програма која за даден природен број n (што се внесува од тастатура) ќе ја повика функцијата f() за да го испечати збирот на цифрите кои се наоѓаат на парни позиции во n.

Пример:

Влез:

717623

Излез:

16

Објаснување:

Збирот на цифрите што се наоѓаат на парни позиции во бројот 717623 е 7 + 7 + 2 = 16.

For example:

Input	Result
717623
        16
 */
#include <stdio.h>

int f(int n){
    if(n==0) return 0;
    else return n/10%10+f(n/100);
}

int main(){
    int n;
    scanf("%d",&n);
    printf("%d",f(n));
    return 0;
}