/*
Да се напише програма која ќе чита три цели броја (x,y,z) од тастатура и на екран ќе го испечати резултатот од следниот израз ++x - --y + z++ + (x>z) Кој резултат ќе се добие доколку ги нема заградите, т.е. изразот е ++x - --y + z++ + x>z? Испечатете го и овај резултат, одделен со празно место од првиот резултат, како во примерот.

For example:

Input	Result
1 2 3
4 1*/
#include <stdio.h>

int main()
{
    float x, y, z, result1, result2;
    scanf("%f %f %f", &x, &y, &z);
    result1 = ++x - --y + z++ + (x>z);
    result2 = ++x - --y + z++ + x>z;
    printf("%.f %.f", result1, result2);
}
