/*
Од стандарден влез се вчитуваат следните податоци за еден студент на ФИНКИ:

    индекс (шестцифрен цел број)
    шест оценки од последниот семестар кој го слушал

 Да се напише програма која што на стандарден излез ќе ги испечати следните информации за студентот: (погледнете во тест примерите за форматот на печатење)

    просек на студентот
        просекот да се испечати со точност од 3 децимали
    година на студии
        студентите чијшто индекс почнува на 17 се трета година, на 16 се четврта година, на 15 се петта година итн.
дали е награден (1 = награден, 0 = не е награден)
        Еден студент се наградува доколку има просек еднаков или поголем од 9.5
For example:

Input	                Result
151021 9 9 10 10 10 8
                        Prosek: 9.333
                        Student: 151021
                        5 godina
                        Nagraden: 0
 */
#include <stdio.h>
#include <stdlib.h>
int main ()
{
    float indeks, o1, o2, o3, o4, o5, o6;
    scanf("%f %f %f %f %f %f %f", &indeks, &o1, &o2, &o3, &o4, &o5, &o6);
    float prosek = (o1 + o2 + o3 +o4 + o5 + o6) / 6;
    printf("Prosek: %.3f\n", prosek);
    printf("Student: %.f\n", indeks);
    float a= indeks/10000;
    int god=21-a;
    printf("%d godina\n", god);
    if (prosek>=9.5)
    {
        printf("Nagraden: 1");
    }
    else
    {
        printf("Nagraden: 0");
    }

}