/*
Да се напише програма каде од тастатура ќе се внесе еден број кој има пет цифри, но не мора да е петцифрен, како на пример 04569 или 00256. Програмата ги печати сумите на паровите цифри од надвор кон внатре, за на крај да ја испечати средишната цифра. Така, ако внесениот број е 12596, програмата враќа 7 11 5.

влез: 12596
излез: 7 11 5
For example:

Input	Result
90008
        17 0 0
 */

#include <stdio.h>

int main ()
{
    int number, a, b;
    scanf("%d", &number);
    a=number/10000;
    b=number%10;
    int equal1=a+b;
    printf("%d ", equal1);
    int c=(number/1000)%10;
    int d=(number/10)%10;
    int equal2=c+d;
    printf("%d ", equal2);
    int e=(number/100)%10;
    printf("%d", e);
}